In [2]:
import pandas as pd

data = {'Name' : ['John', 'Mary', 'Bob', 'Sarah', 'Tom', 'Lisa'], 'Department' : ['IT', 'Marketing', 'Sales', 'IT', 'Finance', 'Marketing'], 'Age' : [30, 40, 25, 35, 45, 28], "Sexe" : ['Homme', 'Femme', 'Homme', 'Femme', 'Homme', 'Femme'], 'Salaire' : [50000, 60000, 45000, 55000, 70000, 55000], 'Expérience' : [3, 7, 2, 5, 10, 4]}

employee_df = pd.DataFrame(data)

## Utilisation de la méthode iloc pour sélectionner les 3 premières lignes du dataframe.

In [7]:
employee_df.iloc[0:3,:]

   Name Department  Age   Sexe  Salaire  Expérience
0  John         IT   30  Homme    50000           3
1  Mary  Marketing   40  Femme    60000           7
2   Bob      Sales   25  Homme    45000           2

## Utilisation de la méthode loc pour sélectionner toutes les lignes où le département est "Marketing"

In [13]:
employee_df.loc[employee_df["Department"]=="Marketing"]

   Name Department  Age   Sexe  Salaire  Expérience
1  Mary  Marketing   40  Femme    60000           7
5  Lisa  Marketing   28  Femme    55000           4

## Utilisation de la méthode iloc pour sélectionner les colonnes Age et Sexe pour les 4 premières lignes du dataframe.

In [15]:
employee_df.iloc[0:4,2:4]

   Age   Sexe
0   30  Homme
1   40  Femme
2   25  Homme
3   35  Femme

## Utilisation de la méthode loc pour sélectionner les colonnes Salaire et Expérience pour toutes les lignes dont le sexe est "Male".

In [17]:
employee_df.loc[employee_df["Sexe"] == "Homme", ["Salaire", "Expérience"]]

   Salaire  Expérience
0    50000           3
2    45000           2
4    70000          10